# Напишите программу, которая принимае
#  на вход цифру, обозначающую день недели,
#  и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет

num = int(input('Введите число: '))
if num == (6) or num == (7):
    print('Да - это выходной день!')
# elif num != (6) or num != (7):
else:
    print('Нет - это будний день!')
