# Напишите программу, которая по заданному
#  номеру четверти, показывает диапазон
#  возможных координат точек в этой четверти
#  (x и y).

Qwadrant = int(input('Введите номер четверти(1,2,3 или 4): '))
if Qwadrant == 1:
    print(f'Диапазон x,y')
elif Qwadrant == 2:
    print(f'Диапазон x,-y')
elif Qwadrant == 3:
    print(f'Диапазон -x,-y')
elif Qwadrant == 4:
    print(f'Диапазон -x,y')
