# Напишите программу, которая принимает
# на вход координаты двух точек и находит
#  расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

x1 = float(input('Введите координаты точки А по х: '))
y1 = float(input('Введите координаты точки A по у: '))
x2 = float(input('Введите координаты точки B по x: '))
y2 = float(input('Введите координаты точки B по у: '))

C = (((x2-x1)**2 + (y2-y1)**2))**(1/2)
print(C)
